able 2
above 3
absolutely 3
access 3
accessories 3
according 4
actually 3
affordable 2
almost 2
aluminium 2
amazed 2
amazing 12
amazingly 3
amazon 5
android 4
angles 5
anything 2
app 2
application 3
applications 2
apps 7
attractive 2
audio 6
available 3
average 12
awesome 54
back-up 2
backup 30
bad 3
battery 99
beautiful 3
been 7
best 25
better 21
big 4
bit 5
body 5
both 10
branded 2
brands 2
bright 3
brightness 4
brilliant 6
budget 10
build 21
built 8
butter 2
buttery 5
button 2
buy 7
buying 4
cable 2
call 18
calling 2
calls 2
cam 4
camera 124
camera- 2
cameras 4
cannot 2
cant 3
capacity 2
card 3
care 2
caused 2
charge 6
charger 2
charging 12
clarity 10
class 3
clear 18
clicks 3
close 2
coating 2
colour 6
colours 2
comes 8
comfortable 4
company 2
compare 2
comparing 2
compete 2
competitive 2
complaints 4
compromises 2
condition 2
configuration 2
connectivity 6
contacts 2
continuously 2
convenient 2
cool 11
coolpad 5
core 3
cost 2
cover 11
crisp 7
crystal 3
current 3
curved 2
customers 2
daylight 3
days 2
deal 2
decent 22
decision 2
definitely 3
delivery 7
descent 2
design 19
device 11
didnt 2
dirt 2
dirty 2
disappoint 2
disappointed 2
display 52
displays 2
does 5
doesnt 5
dont 3
double 2
drawback 3
dual 3
due 3
each 2
ear 4
earphones 3
easily 3
easy 7
efficient 2
end 5
enough 3
entire 2
especially 2
ever 5
every 3
everything 10
excellent 45
except 5
expect 3
expectation 3
expectations 3
expected 4
experience 8
experienced 2
extremely 8
fabulous 2
fall 2
fancy 2
fantastic 3
far 9
fast 33
faster 2
feature 4
features 23
feel 10
feels 8
find 3
fine 7
finger 14
fingerprint 16
finish 2
fit 2
fits 6
fitting 2
flash 4
flip 2
found 2
free 6
front 28
full 10
games 8
gaming 5
gb 3
genuine 2
getting 4
given 2
gives 11
giving 3
glass 6
glitches 2
good 320
goodmacro 2
gorgeous 4
got 6
graphics 2
great 44
grip 2
guard 6
guys 3
had 5
half 4
hand 11
handle 2
handy 6
hang 4
hanging 2
hangs 3
happy 6
hardware 5
has 25
having 3
hd 7
headphones 2
headset 5
heat 4
heated 3
heating 17
heats 2
heavy 2
high 13
highly 2
hold 9
honor 2
hot 2
hours 2
however 2
im 3
images 4
impressive 3
inbuilt 2
inch 5
indeed 2
interface 3
internet 5
issue 4
issues 10
keeping 2
kind 4
lag 15
lagging 4
lags 13
large 2
last 2
lasting 3
lasts 5
led 4
less 6
level 2
life 19
light 25
like 22
liked 4
little 8
lock 3
lol 2
long 12
looking 8
looks 25
lot 3
lots 2
loud 10
love 3
loved 5
lovers 2
low 14
made 3
make 6
makes 3
management 2
mark 4
market 2
massive 2
memory 4
metal 4
minor 3
minutes 2
mobile 40
mode 3
model 5
moderate 5
money 8
more 13
mp 9
much 14
multitasking 7
multiwindow 2
music 6
nd 2
need 2
network 4
never 3
nice 38
nicely 2
night 4
nights 2
no 60
normal 3
not 39
notch 3
nothing 2
octa 3
octacore 2
off 2
offered 2
oil 2
ok 8
online 2
open 3
opened 2
operation 5
option 5
otg 3
others 3
outdoor 3
output 4
outstanding 3
overall 11
package 3
packed 3
palm 2
panel 2
par 2
part 2
people 2
perfect 9
perfectly 5
performance 43
person 2
phone 145
phones 11
photos 4
picture 5
pictures 5
pixel 2
playing 4
point 3
poor 2
power 8
premium 18
pretty 6
price 62
print 11
problem 15
problems 4
processing 4
processor 16
product 30
provided 3
providing 3
proximity 2
purchase 3
purchased 2
quality 102
quick 8
quite 8
ram 5
range 14
rare 2
really 26
rear 23
recommend 2
recording 3
redmi 2
remote 2
removable 2
reproduction 5
resistance 2
resistant 3
resolution 6
response 4
responsive 3
rocker 2
running 3
runs 2
satisfactory 2
satisfied 8
scanner 10
scratch 5
scratches 2
screen 36
second 4
seems 6
segment 2
selfie 3
sensitivity 2
sensor 17
service 4
settings 2
sexy 2
sharp 5
shots 7
should 4
side 4
signal 3
sim 3
simply 3
sims 2
since 3
size 5
sleek 8
slim 10
slot 2
smart 4
smooth 37
smoothly 6
soft 4
software 3
softwares 2
solid 2
sometime 2
sound 34
speaker 9
speakers 5
spec 2
specially 2
specifications 3
specified 2
specs 2
speed 12
star 2
strength 2
strong 2
stunning 4
sturdy 5
stylish 5
such 2
super 24
superb 29
support 5
take 3
takes 7
tempered 2
thank 2
thanks 5
thing 6
those 2
though 7
through 2
till 2
time 11
too 14
top 3
top-notch 2
touch 42
tough 3
tried 2
truly 2
ui 22
unbeatable 2
under 5
unlocking 2
upto 3
usage 2
used 8
useful 3
user 2
using 13
value 7
version 3
very 133
vibrant 2
video 11
viewing 5
vivid 3
voice 3
volume 6
wake 2
water 4
weight 12
weighted 2
were 3
whatsoever 3
while 8
white 2
wifi 2
wise 3
within 2
without 6
working 14
works 12
worth 6
worthy 2
zen 2
zoom 3
