able 8
again 4
air 2
allow 2
allowed 2
already 2
although 2
always 6
amazon 2
android 7
angle 2
another 2
anything 3
apart 5
app 9
appearing 2
application 4
applications 3
apps 10
area 2
around 2
audible 3
audio 5
auto 2
automatically 16
available 8
average 15
awesome 2
backup 11
bad 49
barely 2
battery 76
becomes 2
been 2
before 2
behaving 2
below 2
best 2
better 9
between 2
big 6
biggest 3
bit 2
bloatware 2
blurred 5
blurry 4
both 6
bottom 3
bought 3
box 8
brands 2
bright 2
brightness 4
broken 2
bugs 4
build 5
built 2
bulky 2
button 3
buttons 3
buy 16
buying 6
call 23
calling 3
calls 10
came 4
camera 75
cameras 3
cannot 3
cant 12
car 2
card 10
care 3
center 2
centre 3
charge 6
charged 3
charger 11
charging 19
cheap 13
cheaper 2
chinese 2
claims 2
clarity 6
clear 4
clearly 4
colours 2
coming 4
compared 7
complete 2
completely 2
condition 4
conditions 4
connect 4
connecting 5
connectivity 2
coolpad 6
cost 2
cover 2
cracked 4
custom 2
customer 2
damaged 2
dark 2
data 6
daylight 2
days 14
dead 2
default 4
defective 3
deg 2
delicate 2
device 9
didnt 2
difficult 3
directional 2
disappointed 12
disappointment 3
discharge 2
discharging 2
disliked 2
display 14
does 10
doesnt 5
dont 24
down 6
drain 5
drained 2
draining 8
drains 13
drop 3
due 6
dull 4
during 10
ear 4
earphone 2
earpiece 2
ears 2
end 5
especially 2
every 4
excessive 2
expectations 4
expected 7
experience 4
extremely 3
facing 5
faint 2
far 2
fast 23
faster 5
fastly 3
feature 3
features 4
feel 4
felt 3
few 6
find 2
fine 5
finger 3
finish 3
fit 3
flash 6
flickering 2
found 6
frequent 4
front 8
full 4
fully 2
function 2
game 5
games 8
gb 5
gets 17
getting 20
gift 2
glass 2
glossy 3
good 57
got 18
grainy 3
great 4
guide 3
had 5
hand 4
handset 3
hang 10
hanged 4
hanging 12
hangs 12
happy 3
hard 2
has 12
having 5
headache 2
headphone 2
headset 3
hear 6
heat 11
heated 19
heating 40
heats 10
heavy 4
hence 2
high 7
highly 2
hold 3
home 2
horrible 4
hot 7
hours 10
however 4
icons 2
ignored 2
image 3
images 4
immediately 2
inbuilt 2
indoor 3
inr 3
installation 2
installed 2
installing 2
internal 6
internet 9
irritating 3
isnt 3
issue 16
issues 14
item 2
itself 3
keeps 3
kept 2
lack 2
lag 2
lagging 2
laggy 2
lags 4
last 7
less 3
life 4
light 9
lighting 2
like 15
line 3
little 6
location 5
lollipop 3
looks 5
lot 11
lots 2
loud 2
love 2
low 23
made 3
main 3
major 3
make 3
makes 3
manually 2
many 10
mark 3
maximum 2
mb 2
memory 8
mentioned 3
mic 3
micromax 3
microphone 4
middle 2
minutes 8
miss 2
mobile 32
mobiles 3
mode 2
money 13
month 7
months 6
more 10
move 5
mp 5
much 17
music 2
near 5
need 7
needs 2
net 5
network 14
never 2
new 4
next 2
night 5
no 42
normal 9
not 148
off 10
ok 5
okay 2
old 3
online 2
option 9
order 2
otg 2
others 4
output 2
overheating 4
panel 3
particularly 2
pathetic 4
pay 2
people 5
per 5
performance 14
person 2
phone 155
phones 3
photos 2
pic 2
pictures 8
piece 3
plastic 4
play 6
playing 8
please 8
poor 46
premium 3
pretty 4
price 10
print 3
problem 31
problems 13
processing 3
processor 4
product 39
proper 5
properly 13
proximity 2
purchase 6
purchased 3
purpose 2
put 5
quality 70
quickly 8
ram 6
ready 3
really 8
rear 9
reason 2
reboot 3
received 3
receiving 3
recommended 3
recording 2
regret 2
remains 2
repair 3
replace 3
replacement 6
requested 2
reset 2
resolution 3
response 4
rest 2
restart 3
return 10
returned 3
rings 4
ringtone 5
sar 3
satisfied 5
save 2
screen 33
sd 8
seal 2
second 3
seconds 2
sensor 4
serve 2
service 8
set 4
setting 2
severe 2
showing 3
side 5
signal 7
signals 3
sim 12
since 2
single 2
six 2
skin 2
slot 2
slow 20
sluggish 2
small 2
smart 3
soft 2
software 7
solved 2
someone 2
something 3
sometimes 5
sound 19
space 5
speaker 13
speakers 2
specification 3
speed 5
st 3
stand 2
started 7
starts 3
still 5
stopped 2
storage 4
strength 3
strengths 2
such 2
sucks 4
sudden 2
suddenly 2
sun 3
supplied 2
support 5
supported 3
switch 3
switched 3
system 2
take 6
takes 4
talk 3
talking 2
temperature 2
terrible 5
terribly 2
theres 2
thin 2
thing 6
though 5
till 2
time 24
times 16
today 3
told 2
too 32
top 4
touch 29
touchscreen 3
transfer 2
tried 7
twice 3
ui 9
unable 2
unbearable 4
uncomfortable 2
under 3
unhappy 2
unless 2
until 2
update 4
upto 4
usage 6
used 5
useless 2
user 2
using 27
value 6
version 2
vertical 2
very 107
video 5
voice 14
volume 10
wait 2
wanted 3
waste 9
wasted 2
weak 3
were 3
while 26
white 2
why 2
wifi 8
window 2
within 13
without 4
wont 3
worked 2
working 36
works 2
worse 2
worst 21
worth 4
wrong 2
yellowish 2
